import re

# Словарь для замены кириллических букв на ASCII
cyrillic_to_ascii = {
    "а": "a", "б": "6", "в": "B", "г": "g", "д": "q", "е": "e", "ё": "e",
    "ж": "zh", "з": "3", "и": "u", "й": "u", "к": "k", "л": "l", "м": "m",
    "н": "H", "о": "o", "п": "n", "р": "p", "с": "c", "т": "T", "у": "y",
    "ф": "f", "х": "x", "ц": "ts", "ч": "4", "ш": "W", "щ": "w",
    "ъ": "'", "ы": "", "ь": "'", "э": "e", "ю": "yu", "я": "ya",
    "А": "A", "Б": "b", "В": "B", "Г": "G", "Д": "D", "Е": "E", "Ё": "E",
    "Ж": "ZH", "З": "3", "И": "N", "Й": "N", "К": "K", "Л": "L", "М": "M",
    "Н": "H", "О": "O", "П": "n", "Р": "P", "С": "C", "Т": "T", "У": "Y",
    "Ф": "F", "Х": "X", "Ц": "TS", "Ч": "4", "Ш": "w", "Щ": "W",
    "Ъ": "'", "Ы": "Y", "Ь": "'", "Э": "E", "Ю": "YU", "Я": "YA"
}

# Ввод текста
text = input("Введите текст на кириллице: ")

# Замена кириллических букв на ASCII
for cyrillic_char, ascii_char in cyrillic_to_ascii.items():
    text = re.sub(cyrillic_char, ascii_char, text)

print("Результат:", text)
